## Check-in 1

1. The integer number -999 is often used to represent missing values. Create a `pandas.Series` named `s` with four integer values, two of which are -999. The index of this series should be the the letters A through D.

2. In the [`pandas.Series` documentation](https://pandas.pydata.org/docs/reference/api/pandas.Series.html), look for the method `mask()`. Use this method to update the series `s` so that the -999 values are replaced by NA values. HINT: check the first example in the method's documentation.


## Check-in 2

We can access the data frame's column names via the [`columns` attribute](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.columns.html#pandas.DataFrame.columns). Update the column names to C1 and C2 by updating this attribute.

In [15]:
# Import req libraries
import pandas as pd
import numpy as np

# Create pandas.Series
s = pd.Series([12, -999, 45, -999], index = ['A', 'B', 'C', 'D'])
print(s)
print(type(s))

A     12
B   -999
C     45
D   -999
dtype: int64
<class 'pandas.core.series.Series'>

In [16]:
s

A     12
B   -999
C     45
D   -999
dtype: int64

In [18]:
s.mask(s==-999, inplace=True)

In [19]:
s

A    12.0
B     NaN
C    45.0
D     NaN
dtype: float64

In [7]:
# Check mask documentation

# Mask -999 values in s with default NaN value
s = s.mask(s == -999)

A    12.0
B     NaN
C    45.0
D     NaN
dtype: float64

In [11]:
# make data frame
d = {'col_name_1': pd.Series(np.arange(3)),
    'col_name_2': pd.Series([3.1, 3.2, 3.3])}
df = pd.DataFrame(d)
df

   col_name_1  col_name_2
0           0         3.1
1           1         3.2
2           2         3.3

In [14]:
# Use .columns attribute to rename columns
df.columns = ['C1', 'C2']
df

   C1   C2
0   0  3.1
1   1  3.2
2   2  3.3